In [1]:
import mysql.connector
import pandas as pd

#Python MySQL - Database Connection
mydb = mysql.connector.connect(host="localhost",user="ragu",password="password", database = "Demo")
cursor = mydb.cursor()

In [2]:
#Python Mysql - Use Database
cursor.execute("use Demo")

In [3]:
# Retrieving data using pandas
pd.read_sql_query("SELECT * from Iris",mydb)

      Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm Species
0      1            5.1           3.5            1.4           0.2       A
1      2            4.9           3.0            1.4           0.2       A
2      3            4.7           3.2            1.3           0.2       A
3      4            4.6           3.1            1.5           0.2       A
4      5            5.0           3.6            1.4           0.2       A
..   ...            ...           ...            ...           ...     ...
145  146            6.7           3.0            5.2           2.3       C
146  147            6.3           2.5            5.0           1.9       C
147  148            6.5           3.0            5.2           2.0       C
148  149            6.2           3.4            5.4           2.3       C
149  150            5.9           3.0            5.1           1.8       C

[150 rows x 6 columns]

In [4]:
# Retrieving data using pandas selected part
pd.read_sql_query("SELECT Id , Species from Iris ",mydb)

      Id Species
0      1       A
1      2       A
2      3       A
3      4       A
4      5       A
..   ...     ...
145  146       C
146  147       C
147  148       C
148  149       C
149  150       C

[150 rows x 2 columns]

In [5]:
# Where Clause
pd.read_sql_query("select * from Iris where SepalLengthCm < 5 ",mydb)

     Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm Species
0     2            4.9           3.0            1.4           0.2       A
1     3            4.7           3.2            1.3           0.2       A
2     4            4.6           3.1            1.5           0.2       A
3     7            4.6           3.4            1.4           0.3       A
4     9            4.4           2.9            1.4           0.2       A
5    10            4.9           3.1            1.5           0.1       A
6    12            4.8           3.4            1.6           0.2       A
7    13            4.8           3.0            1.4           0.1       A
8    14            4.3           3.0            1.1           0.1       A
9    23            4.6           3.6            1.0           0.2       A
10   25            4.8           3.4            1.9           0.2       A
11   30            4.7           3.2            1.6           0.2       A
12   31            4.8           3.1            1.6           0.2       A
13   35            4.9           3.1            1.5           0.1       A
14   38            4.9           3.1            1.5           0.1       A
15   39            4.4           3.0            1.3           0.2       A
16   42            4.5           2.3            1.3           0.3       A
17   43            4.4           3.2            1.3           0.2       A
18   46            4.8           3.0            1.4           0.3       A
19   48            4.6           3.2            1.4           0.2       A
20   58            4.9           2.4            3.3           1.0       B
21  107            4.9           2.5            4.5           1.7       C

In [6]:
# Where Clause
pd.read_sql_query("select * from Iris where SepalLengthCm < 5 and PetalLengthCm > 3.3  ",mydb)

    Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm Species
0  107            4.9           2.5            4.5           1.7       C

In [7]:
# Where Clause
pd.read_sql_query("select * from Iris where SepalLengthCm < 5 or PetalLengthCm > 3.3  ",mydb)

      Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm Species
0      2            4.9           3.0            1.4           0.2       A
1      3            4.7           3.2            1.3           0.2       A
2      4            4.6           3.1            1.5           0.2       A
3      7            4.6           3.4            1.4           0.3       A
4      9            4.4           2.9            1.4           0.2       A
..   ...            ...           ...            ...           ...     ...
113  146            6.7           3.0            5.2           2.3       C
114  147            6.3           2.5            5.0           1.9       C
115  148            6.5           3.0            5.2           2.0       C
116  149            6.2           3.4            5.4           2.3       C
117  150            5.9           3.0            5.1           1.8       C

[118 rows x 6 columns]

In [8]:
# Orderby
pd.read_sql_query("select * from Iris where PetalLengthCm > 3.3 order by PetalLengthCm ",mydb)

     Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm Species
0    80            5.7           2.6            3.5           1.0       B
1    61            5.0           2.0            3.5           1.0       B
2    65            5.6           2.9            3.6           1.3       B
3    82            5.5           2.4            3.7           1.0       B
4    81            5.5           2.4            3.8           1.1       B
..  ...            ...           ...            ...           ...     ...
92  132            7.9           3.8            6.4           2.0       C
93  106            7.6           3.0            6.6           2.1       C
94  118            7.7           3.8            6.7           2.2       C
95  123            7.7           2.8            6.7           2.0       C
96  119            7.7           2.6            6.9           2.3       C

[97 rows x 6 columns]

In [9]:
# Before Update Table
pd.read_sql_query("select * from  Iris",mydb)

      Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm Species
0      1            5.1           3.5            1.4           0.2       A
1      2            4.9           3.0            1.4           0.2       A
2      3            4.7           3.2            1.3           0.2       A
3      4            4.6           3.1            1.5           0.2       A
4      5            5.0           3.6            1.4           0.2       A
..   ...            ...           ...            ...           ...     ...
145  146            6.7           3.0            5.2           2.3       C
146  147            6.3           2.5            5.0           1.9       C
147  148            6.5           3.0            5.2           2.0       C
148  149            6.2           3.4            5.4           2.3       C
149  150            5.9           3.0            5.1           1.8       C

[150 rows x 6 columns]

In [10]:
# Update Table
sql = '''update Iris set Id = Id+1 where Species = 'Iris-setosa' '''
cursor.execute(sql)

In [11]:
# After Update Table
pd.read_sql_query("select * from  Iris",mydb)

      Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm Species
0      1            5.1           3.5            1.4           0.2       A
1      2            4.9           3.0            1.4           0.2       A
2      3            4.7           3.2            1.3           0.2       A
3      4            4.6           3.1            1.5           0.2       A
4      5            5.0           3.6            1.4           0.2       A
..   ...            ...           ...            ...           ...     ...
145  146            6.7           3.0            5.2           2.3       C
146  147            6.3           2.5            5.0           1.9       C
147  148            6.5           3.0            5.2           2.0       C
148  149            6.2           3.4            5.4           2.3       C
149  150            5.9           3.0            5.1           1.8       C

[150 rows x 6 columns]

In [12]:
# Delete Data
sql = '''Delete from Iris where Species = 'Iris-setosa' '''
cursor.execute(sql)

In [13]:
pd.read_sql_query("select * from Iris",mydb)

      Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm Species
0      1            5.1           3.5            1.4           0.2       A
1      2            4.9           3.0            1.4           0.2       A
2      3            4.7           3.2            1.3           0.2       A
3      4            4.6           3.1            1.5           0.2       A
4      5            5.0           3.6            1.4           0.2       A
..   ...            ...           ...            ...           ...     ...
145  146            6.7           3.0            5.2           2.3       C
146  147            6.3           2.5            5.0           1.9       C
147  148            6.5           3.0            5.2           2.0       C
148  149            6.2           3.4            5.4           2.3       C
149  150            5.9           3.0            5.1           1.8       C

[150 rows x 6 columns]

In [14]:
# List the Tables
cursor.execute("SHOW Tables")
for x in cursor:
    print(x)

('Iris',)

In [15]:
# create a Table (dummie)
sql ='''CREATE TABLE EMP(
   FIRST_NAME CHAR(20) NOT NULL,
   LAST_NAME CHAR(20),
   AGE INT,
   SEX CHAR(1),
   INCOME FLOAT
)'''
cursor.execute(sql)

In [16]:
# List the Tables
cursor.execute("SHOW Tables")
for x in cursor:
    print(x)

('EMP',)
('Iris',)

In [17]:
# Drop Table
sql = ''' drop table EMP'''
cursor.execute(sql)

In [18]:
# List the Tables
cursor.execute("SHOW Tables")
for x in cursor:
    print(x)

('Iris',)

In [19]:
# Limit clause 
pd.read_sql_query("select Id from Iris LIMIT 2",mydb)

   Id
0   1
1   2

In [20]:
# Limit clause 
pd.read_sql_query("select * from Iris LIMIT 2",mydb)

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm Species
0   1            5.1           3.5            1.4           0.2       A
1   2            4.9           3.0            1.4           0.2       A

In [21]:
# Limit with offset
pd.read_sql_query("select * from Iris LIMIT 2 offset 4 ",mydb) #includes last row of limit and first row of offset

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm Species
0   5            5.0           3.6            1.4           0.2       A
1   6            5.4           3.9            1.7           0.4       A

In [22]:
cursor.close()

True

In [23]:
# Exercise 6: Querying the Salespeople Table Using Basic Keywords in a SELECT Query
pd.read_sql_query("select Id from Iris where Species ='Iris-versicolor' order by PetalWidthCm LIMIT 10  ",mydb)

Empty DataFrame
Columns: [Id]
Index: []

In [24]:
# Exercise 7: Creating a Table in SQL
cursor.execute("create Table iris(Id INT,SepalLengthCm FLOAT , SepalWidthCm FLOAT, PetalLengthCm FLOAT, PetalWidthCm FLOAT , Species VARCHAR(16))")

ProgrammingError: 2055: Cursor is not connected

In [ ]:
# List Tables
cursor.execute("SHOW Tables")

for x in cursor:
    print(x)

In [ ]:
# Before Updating
pd.read_sql_query("select * from Iris where PetalWidthCm > 1.5 and PetalWidthCm < 3",mydb)

In [ ]:
# Exercise 8: Updating Tables in SQL
sql = ''' update Iris SET Id = Id +1 where PetalWidthCm > 1.5 and PetalWidthCm < 3'''
cursor.execute(sql)

In [ ]:
# After Updating
pd.read_sql_query("select * from Iris where PetalWidthCm > 1.5 and PetalWidthCm < 3",mydb)

In [ ]:
# Exercise 9: Unnecessary Reference Table
sql = '''drop table iris'''
cursor.execute(sql)

In [ ]:
# List Tables
cursor.execute("SHOW Tables")

for x in cursor:
    print(x)